# RDBMS and SQL

Complete the tasks listed below. You can submit the completed lab until 11:59 PM in the night.

<u>Requirement:</u><br>
Do your best to write Pythonic code instead of the traditional programming code.

### Task 1 (2 marks)

Connect to the supplied database __petsDB__, and write a function named __is_open__ to check if the connection is open or closed. The function, when called, should return either True or False depending upon whether the connection to the database is open or closed. The output in the two cases should look as follows:

True

Connection closed. Cannot operate on a closed database.<br>False

<u>Hint:</u> Use __try__ and __except__ along with the exception error `sqlite3.ProgrammingError` in conjunction with __except__.

In [108]:
### Write your code below this comment.
import sqlite3
def is_open(conn):
     try:
        conn.cursor()
        return True
     except sqlite3.ProgrammingError:
        return print('Connection closed. Cannot operate on a closed database.\n', False, sep='')

In [109]:
conn = sqlite3.connect("petsdb")
is_open(conn)

True

In [110]:
conn.close()
is_open(conn)

Connection closed. Cannot operate on a closed database.
False

### Task 2 (2 marks)

Now connect to the provided database __petsDB__ once again and retrieve the names of all the tables from the database as a list of tuples. Also retrieve the column names for all the tables as a list of strings. The outputs should look as follows respectively:

    The names of the tables in the database are as follows:

    [('persons',), ('pets',)]

    The names of the columns in the table 'persons' are as follows:

    ['Id', 'First Name', 'Last Name', 'Age', 'City', 'Zip Code']:

    The first 5 rows in the table 'persons' are as follows:
    
    [(1, 'Erica', None, 22, 'south port', 2345678),
     (2, 'Jordi', None, 73, 'east port', 123456),
     (3, 'Chasity', None, 70, 'new port', 76856785),
     (4, 'Gregg', None, 31, 'new port', 76856785),
     (5, 'Tony', 'Lindgren', 7, 'west port', 2345678)]
     
    The names of the columns in the table 'pets' are as follows:

    ['Owner Id', 'Pet Name', 'Pet Type', 'Treatment Done']:

    The first 5 rows in the table 'pets' are as follows:
    
    [(57, 'mani', 1.0, 0),
     (80, 'tamari', None, 0),
     (25, 'raba', None, 0),
     (27, 'olga', None, 0),
     (60, 'raba', None, 0)]

<u>Hint:</u> Use __sqlite_master WHERE__ ... You would also need to use list comprehension along with the string __join__ method and __map__ function so that the names of columns ('Id', 'First Name' etc) are in title case and separated by a space instead of lower case and separated by hyphens (which is the case with the names coming from the database).

In [111]:
### Write your code below this comment.
def to_title(name):
  return name.replace('_',' ').title()

In [112]:
conn = sqlite3.connect("petsdb")
cursor = conn.cursor()
table_names = cursor.execute("SELECT name FROM sqlite_schema WHERE type='table' AND name NOT LIKE 'sqlite_%'")
print('The names of the tables in the database are as follows:\n \n', table_names.fetchall(),sep='')

# persons table
persons_cursor  = cursor.execute("SELECT * FROM persons")
persons_columns = [to_title(column[0]) for column in persons_cursor.description]
print("\nThe names of the columns in the table 'persons' are as follows: \n \n", persons_columns, sep='')
persons_data = persons_cursor.fetchall()
print("\nThe first 5 rows in the table 'persons' are as follows:\n \n", ',\n'.join(map(str,persons_data[0:5])), sep='')

# pets table
pets_cursor = cursor.execute("SELECT * FROM pets")
pets_columns = [to_title(column[0]) for column in pets_cursor.description]
print("\nThe names of the columns in the table 'pets' are as follows: \n \n", pets_columns, sep='')
pets_data = pets_cursor.fetchall()
print("\nThe first 5 rows in the table 'pets' are as follows:\n \n", ',\n'.join(map(str,pets_data[0:5])), sep='')

The names of the tables in the database are as follows:

[('persons',), ('pets',)]

The names of the columns in the table 'persons' are as follows:

['Id', 'First Name', 'Last Name', 'Age', 'City', 'Zip Code']

The first 5 rows in the table 'persons' are as follows:

(1, 'Erica', None, 22, 'south port', 2345678),
(2, 'Jordi', None, 73, 'east port', 123456),
(3, 'Chasity', None, 70, 'new port', 76856785),
(4, 'Gregg', None, 31, 'new port', 76856785),
(5, 'Tony', 'Lindgren', 7, 'west port', 2345678)

The names of the columns in the table 'pets' are as follows:

['Owner Id', 'Pet Name', 'Pet Type', 'Treatment Done']

The first 5 rows in the table 'pets' are as follows:

(57, 'mani', 1.0, 0),
(80, 'tamari', None, 0),
(25, 'raba', None, 0),
(27, 'olga', None, 0),
(60, 'raba', None, 0)

### Task 3 (2 marks)

Now transform the tables __persons__ and __pets__ into two Dataframes named __df_persons__ and __df_pets__ respectively, so that you can go ahead with the tasks to follow.

In [113]:
### Write your code below this comment.
import pandas as pd
df_persons = pd.DataFrame(persons_data, columns=persons_columns)
df_pets = pd.DataFrame(pets_data, columns=pets_columns)
df_persons

     Id First Name Last Name  Age        City  Zip Code
0     1      Erica      None   22  south port   2345678
1     2      Jordi      None   73   east port    123456
2     3    Chasity      None   70    new port  76856785
3     4      Gregg      None   31    new port  76856785
4     5       Tony  Lindgren    7   west port   2345678
..  ...        ...       ...  ...         ...       ...
95   96    Ernesto      None   69   east port   9756543
96   97   Josianne      None   14   west port  76856785
97   98      Hilma   Waelchi   48   east port   9756543
98   99     Otilia   Gleason   66    new port   9756543
99  100     Adrian  Schinner    5  south port  76856785

[100 rows x 6 columns]

### Task 4 (2 marks)

Consider the following question:

__What are counts for each unique age group in the persons database?__

Answer this question using a SQL query from the database (save it as __sql_4__) as well as using the Dataframe __df_persons__ you created in Task 3 above.

The SQL query should return a list of tuples named __rows__ which you should then use to create a Dataframe named __df_sql__ with an index column named `'Age'` and another column named `'Counts'`. The Dataframe should look as follows:

<img align=left src="images/df_sql_res4.png" height="105" width="105">

Similarly, also use methods from __pandas__ in conjunction with the Dataframe __df_persons__ to mimic your SQL query and create another Dataframe named __df_pd__ which looks exactly the same as the Dataframe __df_sql__ shown above.

In [114]:
### Write your code below this comment.
sql_4 = cursor.execute("SELECT age, count(age) FROM persons GROUP BY age").fetchall()
df_sql = pd.DataFrame(sql_4, columns = ['Age', 'Counts'])
df_sql.set_index('Age', inplace=True)
df_sql.head()

     Counts
Age
5         2
6         1
7         1
8         3
9         1

In [115]:
df_pd = df_persons.groupby('Age')[['Age']].size().reset_index(name='Counts').set_index('Age')
df_pd.head()

     Counts
Age
5         2
6         1
7         1
8         3
9         1

Now answer the following question:

What similarities / differences did you find between the SQL query you wrote and saved as __sql_4__ and the code you used to create the Dataframe __df_pd__?

__Answer__: What I found similar was that even though the function names are syntactically different (GROUP BY for SQL and groupby for python) the approach is the same, you first have to group the data set by age, and then apply an aggregation function which in the case of SQL was count, and for python was size (a difference). The selection process is easier to undestand in SQL (just SELECT column_name) whereas in python we have to do indexing.

### Task 5 (2 marks)

Consider the following question:

__How many pets are there from the city called "east port"?__

Answer this question using a SQL query from the database (save it as __sql_5__). Also use methods from __pandas__ in conjunction with the Dataframes __df_persons__ and __df_pets__ you created in Task 3 above to mimic your SQL query. Save the joined Dataframe as __df_pd_join__.

In both cases, the output is a number.

In [116]:
### Write your code below this comment.
sql_5 = [row for row in cursor.execute("SELECT COUNT(pets.pet_name) FROM pets INNER JOIN persons ON pets.owner_id=persons.id GROUP BY persons.city HAVING city = 'east port'")][0][0]
sql_5

49

In [117]:
df_pd_join = df_pets.merge(df_persons, how='right', left_on=df_pets['Owner Id'], right_on=df_persons['Id'])

df_pd_join[df_pd_join['City']=='east port'].groupby('City')['Pet Name'].count()

City
east port    49
Name: Pet Name, dtype: int64

Now answer the following question:

What similarities / differences did you find between the SQL query you wrote and saved as __sql_5__ and the code you used to create the Dataframe __df_pd_join__?

__Answer__: Same as the last question, what I found similar was the approach. With the SQL query we join the tables, group by city, filter the wanted city and apply the aggregation function count to the desired columns. Similar approach is taken with python, with a little more complicated code. We join the tables, then apply a conditional filter to select the wanted city, group by city and apply the aggregation function count.

SQL is overall easier to access and extract data, whereas python has much more powerful functionalities that make it easier to analyze and manipulate data.

In [118]:
conn.close()
is_open(conn)

Connection closed. Cannot operate on a closed database.
False